run/hpc/atmDispersionGas/gasBase/constant/thermo.reactions
species
(
    air
    gas
);
reactions
{}
