run/hpc/atmDispersionGas/gasBase/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         reactingMixture;
    transport       const;
    thermo          hConst;
    energy          sensibleEnthalpy;
    equationOfState incompressiblePerfectGas;
    specie          specie;
}

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/thermo.reactions";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.constGas";

inertSpecie     air;


// ************************************************************************* //
